//1. 修改视图中的数据
 update view_name_gender set gender='男' where name='张三';
//查看视图中的数据是否被修改
mysql> select * from view_name_gender;
+------+--------+
| name | gender |
+------+--------+
| 张三 | 男     |
| 李四 | 男     |
+------+--------+

//2. 查看数据表account中的数据有没有被修改
mysql> select * from account;
+----+------+---------+--------+---------+---------+
| id | name | balance | gender | address | phone   |
+----+------+---------+--------+---------+---------+
|  1 | 张三 |     100 | 男     | 陕西省  | 123456  |
|  2 | 李四 |     200 | 男     | 山西省  | 9999999 |
+----+------+---------+--------+---------+---------+
